Autodesk.Revit.DB.Plumbing.FlexPipe.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new flexible pipe into the document, using a point array and flex pipe type.
document:
The document.
systemTypeId:
The id of the piping system type.
pipeTypeId:
The id of the flexible pipe.
levelId:
The level id for the flexible pipe.
startTangent:
The tangent vector at the start of the curve. The invalid or zero vector is ignored.
endTangent:
The tangent vector at the end of the curve. The invalid or zero vector is ignored.
points:
The point array indicating the path of the flexible pipe, including the end point.
Returns:
If creation was successful then a new flexible pipe is returned, otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid piping system type.
-or-
The type pipeTypeId is not valid flexible pipe type.
-or-
The ElementId levelId is not a Level.
-or-
The valid number of points is less than two. In order to create a flex curve, at least two points are required. Note the duplicate points don't take into account.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Plumbing.FlexPipe.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new flexible pipe into the document, using a point array and flex pipe type.
document:
The document.
systemTypeId:
The id of the piping system type.
pipeTypeId:
The id of the flexible pipe.
levelId:
The level id for the flexible pipe.
points:
The point array indicating the path of the flexible pipe, including the end point.
Returns:
If creation was successful then a new flexible pipe is returned, otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid piping system type.
-or-
The type pipeTypeId is not valid flexible pipe type.
-or-
The ElementId levelId is not a Level.
-or-
The valid number of points is less than two. In order to create a flex curve, at least two points are required. Note the duplicate points don't take into account.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014